In [1]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [7]:
df = DataFrame({'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [8]:
df

        one       two     three
a -1.277093  0.650654       NaN
b  0.222504  0.369018 -0.733026
c  0.807403  0.112715  1.017476
d       NaN -0.691644  0.321444

In [4]:
df2 = df.copy()

In [5]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [6]:
df2.ne(df)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [10]:
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [11]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [12]:
Series([True]).bool

<bound method NDFrame.bool of 0    True
dtype: bool>

In [13]:
Series([False]).bool

<bound method NDFrame.bool of 0    False
dtype: bool>

In [15]:
DataFrame([[True]]).bool

<bound method NDFrame.bool of       0
0  True>

In [17]:
DataFrame([[False]]).bool

<bound method NDFrame.bool of        0
0  False>

In [18]:
Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [19]:
Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [20]:
Series(['foo', 'bar', 'baz']) == pd.Series(['foo', 'bar'])

ValueError: Can only compare identically-labeled Series objects

In [21]:
(df + df == df * 2).all().all()

False

In [22]:
(df + df == df * 2).all()

one      False
two       True
three    False
dtype: bool

In [25]:
df

        one       two     three
a -1.277093  0.650654       NaN
b  0.222504  0.369018 -0.733026
c  0.807403  0.112715  1.017476
d       NaN -0.691644  0.321444

In [26]:
df + df

        one       two     three
a -2.554185  1.301307       NaN
b  0.445008  0.738036 -1.466053
c  1.614805  0.225430  2.034951
d       NaN -1.383287  0.642887

In [27]:
df * 2

        one       two     three
a -2.554185  1.301307       NaN
b  0.445008  0.738036 -1.466053
c  1.614805  0.225430  2.034951
d       NaN -1.383287  0.642887

In [29]:
df + df == df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [30]:
np.nan == np.nan, np.nan is np.nan

(False, True)

In [31]:
df + df is df * 2

False

In [32]:
df.mean(axis=0)  # mean for COLUMNS

one     -0.082395
two      0.110186
three    0.201964
dtype: float64

In [34]:
df.mean(axis=1)  # mean for ROWS

a   -0.313219
b   -0.047168
c    0.645864
d   -0.185100
dtype: float64

In [38]:
ts_stand = (df - df.mean()) / df.std()
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [39]:
df.describe()

            one       two     three
count  3.000000  4.000000  3.000000
mean  -0.082395  0.110186  0.201964
std    1.075176  0.577938  0.881346
min   -1.277093 -0.691644 -0.733026
25%   -0.527294 -0.088375 -0.205791
50%    0.222504  0.240867  0.321444
75%    0.514953  0.439427  0.669460
max    0.807403  0.650654  1.017476

In [51]:
ser = Series(np.random.randn(1000))

In [53]:
ser = ser[::2]

In [54]:
ser.describe()

count    500.000000
mean       0.023409
std        0.998627
min       -3.790956
25%       -0.615364
50%        0.053393
75%        0.655347
max        4.098017
dtype: float64

In [81]:
frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])
frame

            a         b         c         d         e
0    0.327783  2.065493  0.242680 -0.640007 -0.769534
1   -0.164449 -0.903573 -1.256171 -0.323233  0.798978
2   -1.910295 -2.761255 -0.773868  0.828245 -0.429529
3   -0.067286 -0.421269 -0.399826 -0.141985  1.081017
4   -0.650025  0.761522 -0.656499  0.217339  1.760085
..        ...       ...       ...       ...       ...
995 -1.072560  1.128751 -0.033726 -0.612766  0.208447
996  0.241751 -0.988915  0.881877  1.138933  0.090346
997 -0.360404 -1.038404 -1.519500 -2.274600 -0.459918
998  0.357776  0.717990 -0.086318 -0.664227  0.318632
999 -0.885713 -0.310424 -0.532757 -0.093758 -1.321046

[1000 rows x 5 columns]

In [82]:
frame.iloc[::2] = np.nan
frame

            a         b         c         d         e
0         NaN       NaN       NaN       NaN       NaN
1   -0.164449 -0.903573 -1.256171 -0.323233  0.798978
2         NaN       NaN       NaN       NaN       NaN
3   -0.067286 -0.421269 -0.399826 -0.141985  1.081017
4         NaN       NaN       NaN       NaN       NaN
..        ...       ...       ...       ...       ...
995 -1.072560  1.128751 -0.033726 -0.612766  0.208447
996       NaN       NaN       NaN       NaN       NaN
997 -0.360404 -1.038404 -1.519500 -2.274600 -0.459918
998       NaN       NaN       NaN       NaN       NaN
999 -0.885713 -0.310424 -0.532757 -0.093758 -1.321046

[1000 rows x 5 columns]

In [83]:
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean    -0.047574    0.037240    0.070558   -0.063887    0.031079
std      0.984716    1.019264    0.992142    1.008691    1.028068
min     -2.881592   -2.999257   -2.656253   -2.650771   -3.096010
25%     -0.718982   -0.618710   -0.568646   -0.818632   -0.636589
50%     -0.076383    0.027136    0.063906   -0.109400    0.086686
75%      0.606132    0.672818    0.793101    0.676393    0.696996
max      2.827577    3.718741    2.774847    2.776180    2.750195

In [84]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])

In [85]:
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [111]:
s1 = pd.Series(np.random.randn(5))
s1

0   -0.890723
1   -1.630657
2   -0.133315
3    0.952471
4    0.118509
dtype: float64

In [114]:
s1.idxmin()

1

In [115]:
s1.idxmax()

3

In [116]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1

          A         B         C
0 -0.517201 -1.137464  0.048101
1 -0.369530  0.185130 -0.331872
2 -0.800129  0.457021  0.721076
3 -2.229096  0.410158  0.591048
4  0.404710  0.362658 -0.814133

In [117]:
df1.idxmin(axis=0), df1.idxmax(axis=0)

(A    3
 B    0
 C    4
 dtype: int64,
 A    4
 B    2
 C    2
 dtype: int64)

In [118]:
df1.idxmin(axis=1), df1.idxmax(axis=1)

(0    B
 1    A
 2    A
 3    A
 4    C
 dtype: object,
 0    C
 1    B
 2    C
 3    C
 4    A
 dtype: object)

In [123]:
df = pd.DataFrame({'col_1': np.random.randn(3),
                     'col_2': np.random.randn(3)}, index=['a', 'b', 'c'])
df

      col_1     col_2
a -0.214619 -0.854709
b -0.367464 -0.295961
c  0.028763  0.647605

In [124]:
for col in df:
    print(col)

col_1
col_2

In [127]:
for col, row in df.items():
    print(row)

a   -0.214619
b   -0.367464
c    0.028763
Name: col_1, dtype: float64
a   -0.854709
b   -0.295961
c    0.647605
Name: col_2, dtype: float64

In [128]:
for row in df.iterrows():
    print(row)

('a', col_1   -0.214619
col_2   -0.854709
Name: a, dtype: float64)
('b', col_1   -0.367464
col_2   -0.295961
Name: b, dtype: float64)
('c', col_1    0.028763
col_2    0.647605
Name: c, dtype: float64)

In [130]:
for t in df.itertuples():
    print(t)

Pandas(Index='a', col_1=-0.21461942523844593, col_2=-0.8547087798100554)
Pandas(Index='b', col_1=-0.3674638685401909, col_2=-0.2959608507815676)
Pandas(Index='c', col_1=0.028762863183936456, col_2=0.6476047038371452)